Repository: payneteasy/ReaderExample
Catalog: ReaderExample/PaymentModule/i18n/*.lproj/Localizable.strings
Languages: ru

# PNEReaderState_CONNECTED
source: Terminal is connected
ru: Терминал подключен

# PNEReaderState_CONNECTING
source: Connecting to terminal ...
ru: Подключение к терминалу...

# PNEReaderState_MIURA_BATTERY_STATUS_RESPONSE
source: Battery %@: %@ %
ru: Батарея %@: %@ %

# PNEReaderState_NOT_CONNECTED
source: Unable to connect to terminal
ru: Не удалось подключиться к терминалу

# PNEReaderState_STARTED
source: Connecting to terminal ...
ru: Подключение к терминалу ...

# PNEReaderState_MIURA_CARD_STATUS__INSERT_CARD
source: Insert Card
ru: Вставьте карту

# PNEReaderState_MIURA_CARD_STATUS__READING_CARD
source: Please wait, reading card ...
ru: Чтение карты ...

# MiuraPinEntryStatus_INCORRECT_PIN
source: Incorrect PIN
ru: Неверный ПИН. Повторите ввод.

# MiuraPinEntryStatus_LAST_POSSIBLE_ATTEMPT
source: Last Attempt To Enter PIN
ru: Последняя попытка для ввода ПИН, если ПИН будет введен неправильно, карта заблокируется

# MiuraPinEntryStatus_PIN_ENTRY_COMPLETED
source: PIN Entry completed
ru: Ввод ПИН завершен

# MiuraPinEntryStatus_PIN_ENTRY_ERROR
source: PIN Entry ERROR
ru: Ошибка при вводе ПИН

# MiuraPinEntryStatus_PIN_OK
source: PIN OK
ru: ПИН введен правильно

# PNEReaderState_MIURA_DEVICE_INFO__APPLICATION_SELECTION
source: Select application on terminal
ru: Выберите приложение на терминале

# PNEReaderState_MIURA_DEVICE_INFO__DEVICE_POWERING_OFF
source: Terminal is powering off...
ru: Терминал выключается ...

# PNEReaderState_MIURA_DEVICE_INFO__MPI_RESTARTING
source: Terminal is restarting ...
ru: Терминал перегружается ...

# MiuraPinEntryStatus_UNKNOWN
source: Please wait ...
ru: Идет обработка ...

# PNEReaderState_MIURA_DEVICE_INFO__PROCESSING
source: Please wait ...
ru: Идет обработка ...

# PNEProcessingEventType_EXCEPTION
source: Error
ru: Ошибка

# PNEProcessingEventType_ADVICE_REQUIRED
source: Processing advice ...
ru: Обработка платежа...

# PNEProcessingEventType_ADVICE_RESPONSE_WAITING
source: Waiting for advice ...
ru: Ожидание ответа ...

# PNEProcessingEventType_ADVICE_SENDING
source: Sending advice ...
ru: Передача подтверждение ...

# PNEProcessingEventType_ERROR_3D_SECURE
source: Gate does not configure properly, contact your support
ru: Ошибка настройки гейта, обратитесь в службу поддержки

# PNEProcessingEventType_SALE_SENDING
source: Sending sale...
ru: Передача платежа...

# PNEProcessingEventType_SALE_RESPONSE_WAITING
source: Waiting sale response ...
ru: Ожидание ответа...

# PNEProcessingEventType_UNKNOWN
source: Unknown event type
ru: Неизвестный тип события

# PaynetStatusTypeApproved
source: APPROVED
ru: ОДОБРЕНО

# PaynetStatusTypeDeclined
source: DECLINED
ru: Отклонено

# PaynetStatusTypeError
source: ERROR, Contact Your Support
ru: Ошибка, обратитесь в службу поддержки

# PaynetStatusTypeFiltered
source: DECLINED
ru: Отклонено

# PaynetStatusTypeProcessing
source: Processing ...
ru: Обработка...

# PaynetStatusTypeUnknown
source: ERROR, Contact Your Support
ru: Ошибка, обратитесь в службу поддержки

# MiuraBatteryStatusType_CHARGING
source: Charging
ru: Заряжается

# MiuraBatteryStatusType_FULLY_CHARGED
source: Charged
ru: Заряжено

# MiuraBatteryStatusType_NOT_CHARGING
source: Not charging
ru: Не заряжяется

# MiuraBatteryStatusType_UNKNOWN
source: Unknown(%@)
ru: Неизвестно(%@)

# MiuraPinEntryStatus__ENTERING_PIN
source: Entering PIN: %@
ru: Вводится ПИН: %@

# MiuraPinEntryStatus__ENTER_PIN
source: Enter PIN
ru: Введите ПИН

# PNEReaderState_MIURA_DEVICE_INFO
source: Miura Serial Number: %@
ru: Miura Серийный Hомер: %@

# PNEReaderState_CONFIGURATION_DOWNLOADING
source: Downloading configuration from server...
ru: Получение настроек с сервера ...

# PNEReaderState_CONFIGURATION_UPLOADING
source: Uploading configuration to terminal ...
ru: Загрузка настроек в терминал...

# PNEReaderState_CONFIGURATION_COMPLETE
source: Configuration is done
ru: Терминал настроен

# PNEReaderState_SENDING_SALE
source: Authorisation ...
ru: Авторизация ...

# PNEReaderState_SENDING_EMF_FINAL_ADVICE
source: Sending advice ...
ru: Подтверждение ...

# SpireStatusType_CardEntryPrompted
source: Card Entry Prompted
ru: Вставьте карту

# SpireStatusType_SmartcardInserted
source: Smartcard Inserted
ru: Карта вставлена

# SpireStatusType_SmartcardRemovePrompted
source: Smartcard Remove Prompted
ru: Возьмите карту

# SpireStatusType_SmartcardRemoved
source: Smartcard Removed
ru: Карта взята

# SpireStatusType_CardEntryBypassed
source: Card Entry Bypassed
ru: Ввод карты пропущен

# SpireStatusType_CardEntryTimedOut
source: Card Entry Timed Out
ru: Превышено время ожидания ввода карты

# SpireStatusType_CardEntryAborted
source: Card Entry Aborted
ru: Ввод карты отменен

# SpireStatusType_CardSwiped
source: Card Swiped
ru: Считана магнитная полоса

# SpireStatusType_CardSwipeError
source: Card Swipe Error
ru: Ошибка чтения магнитной полосы

# SpireStatusType_ContactlessCardTapped
source: Contactless Card Tapped
ru: Приложена бесконтактная карта

# SpireStatusType_ContactlessCardTapError
source: Contactless Card Tap Error
ru: Ошика чтения бесконтактной карты

# SpireStatusType_ApplicationSelectionStarted
source: Application Selection Started
ru: Выбор приложения на карте ...

# SpireStatusType_ApplicationSelectionCompleted
source: Application Selection Completed
ru: Выбор приложения на карте завершен

# SpireStatusType_PinEntryStarted
source: Pin Entry Started
ru: Введите ПИН

# SpireStatusType_PinEntryCompleted
source: Pin Entry Completed
ru: Ввод ПИН завершен

# SpireStatusType_PinEntryAborted
source: Pin Entry Aborted
ru: Ввод ПИН отменен

# SpireStatusType_PinEntryBypassed
source: Pin Entry Bypassed
ru: Ввод ПИН пропущен

# SpireStatusType_PinEntryTimedOut
source: Pin Entry Timed Out
ru: Превышено время ожидания ввода ПИН

# SpireStatusType_LastPinEntry
source: Last Pin Entry
ru: Последняя попытка для ввода ПИН

# SpireStatusType_AmountConfirmationStarted
source: Amount Confirmation Started
ru: Потдвердите сумму на терминале

# SpireStatusType_AmountConfirmationCompleted
source: Amount Confirmation Completed
ru: Сумма подтверждена

# SpireStatusType_AmountConfirmationAborted
source: Amount Confirmation Aborted
ru: Подтверждение суммы отменено

# SpireStatusType_AmountConfirmationBypassed
source: Amount Confirmation Bypassed
ru: Подтверждение суммы пропущено

# SpireStatusType_AmountConfirmationTimedOut
source: Amount Confirmation Timed Out
ru: Превышено время подтвержения суммы на терминале

# PNEReaderState_SPIRE_COMPLETE_TRANSACTION
source: Transaction completed
ru: Транзакция завершена

# PNEReaderState_SPIRE_GET_AMOUNT
source: Get Amount
ru: Получение суммы

# PNEReaderState_SPIRE_GET_SWIPED_DATA
source: Card Swiped
ru: Получение данных магнитной полосы

# PNEReaderState_SPIRE_GET_TRANSACTION_DATA
source: Please wait, getting transcation data ...
ru: Чтение карты...

# PNEReaderState_SPIRE_GO_ONLINE
source: Online authorisation ...
ru: Онлайн авторизация...

# PNEReaderState_SPIRE_PROCESS_SWIPED_DATA
source: Processing card swiped data ...
ru: Обработка данные магнитной полосы ...

# PNEReaderState_SPIRE_TERMINATE_TRANSACTION
source: Transaction terminating...
ru: Отмена транзакции...

# PNEReaderState_SPIRE_INIT_TRANSACTION
source: Init transaction...
ru: Инициализация транзакции...

# PNECardErrorType_PARSE_PACKET_ERROR
source: Parse packet error
ru: Ошибка чтения данных от терминала

# PNECardErrorType_PARSE_TRACK_ERROR
source: Parse track error
ru: Ошибка чтения трека

# PNECardErrorType_EMPTY_CARD_INFO
source: Empty card info
ru: Нет данных на карте

# PNECardErrorType_UNKNOWN_CARD_TYPE
source: Unknown card type
ru: Неизвестный тип карты

# PNECardErrorType_CARD_NOT_VALID
source: Card not valid
ru: Недействующая карта

# PNECardErrorType_SKIP
source: Skip
ru: Пропущено

# PNECardErrorType_BAD_PACKET_LRC
source: Bad packet lrc
ru: Пакет от терминала не прошел проверку на LRC

# PNECardErrorType_ERROR_DOWNLOADING_CONFIGURATION
source: Error downloading configuration
ru: Ошибка загрузки конфигурации

# PNECardErrorType_NO_CONFIGURATION_CONTINUATION
source: No configuration continuation
ru: Нет данных для загрузки настроек

# PNECardErrorType_NOT_SRED_READY
source: Not SRED Ready
ru: В терминале нет ключей шифрования

# PNECardErrorType_INVALID_DATA_IN_COMMAND_APDU
source: Invalid data in command APDU
ru: Неверные данные в команде APDU

# PNECardErrorType_TERMINAL_NOT_READY
source: Terminal not ready (Continue before Start)
ru: Терминал не готов

# PNECardErrorType_NO_SMART_CARD_IN_SLOT
source: No smartcard in slot
ru: Нет смарт-карты в слоте

# PNECardErrorType_INVALID_CARD
source: Invalid card, card responded incorrectly, no MSR fall back allowed
ru: Неверная карта, карта ответила неправильно, переход на MSR не допускается

# PNECardErrorType_TRANSACTION_ALREADY_IN_PROGRESS
source: Transaction already in progress.
ru: Транзакция в процессе

# PNECardErrorType_DATA_MISSING_FROM_COMMAND_APDU
source: Data missing from command APDU (data field should list missing object(s)
ru: Нет данных в команде APDU

# PNECardErrorType_UNSUPPORTED_CARD
source: Unsupported card, EMV Kernel not configured for this card, MSR fall back allowed
ru: Неподдерживаемый карта, EMV Kernel не настроен для этой карты, MSR fallback допускается

# PNECardErrorType_MISSING_FILE
source: Missing file (data field should list missing file)
ru: Отсутствует файл (поле должно содержать отсутствующий файл)

# PNECardErrorType_ICC_READ_ERROR
source: ICC Read error, MSR fall back allowed
ru: Ошибка ICC Read, MSR fallback допускается

# PNECardErrorType_INVALID_ISSUER_PUBLIC_KEY
source: Invalid issuer public key, hash check failed
ru: Неверный эмитент открытого ключа, проверка хэша не удалась

# PNECardErrorType_USER_CANCELLED
source: User Cancelled, Transaction Cancelled by the Cancel key pressed or a command Abort received
ru: Отменено пользователем

# PNECardErrorType_TRANSACTION_TIMED_OUT
source: Transaction Timed Out - Polling time-out elapsed with no card presented in field
ru: Превышено время ожидания

# PNECardErrorType_TRANSACTION_ABORTED_BY_INSERTED
source: Transaction Aborted by a card being inserted
ru: Транзакция отменена при вводе карты

# PNECardErrorType_TRANSACTION_ABORTED_BY_SWIPED
source: Transaction Aborted by a card being swiped
ru: Транзакция отменена при проведении карты

# PNECardErrorType_NO_APPLICATIONS
source: No applications for the transaction conditions: Transaction should be performed using ICC or MSR
ru: Нет приложений на карте. Транзакция должна быть выполнена с использованием ICC или MSR

# PNECardErrorType_TRANSACTION_NOT_POSSIBLE
source: Transaction not possible: Transaction should be performed using ICC, MSR or another Card
ru: Транзакция не представляется возможным: Транзакция должна быть выполнена с использованием ICC, MSR или другой карты

# PNECardErrorType_USE_ICC
source: The card asked for Chip interface: Transaction should be performed using ICC
ru: Транзакция должна быть выполнена с использованием чипованной карты

# PNECardErrorType_HARDWARE_ERROR
source: Hardware error
ru: Аппаратная ошибка

# PNECardErrorType_SPIRE_GENERAL_FAILURE
source: (mPOS) General Failure
ru: (mPOS) Общий сбой

# PNECardErrorType_SPIRE_CHIP_APPLICATION_SELECTION_FAILURE
source: (Chip) Application Selection Failure
ru: (Карта) Ошибка выбора приложения

# PNECardErrorType_SPIRE_CHIP_INITIATE_APPLICATION_PROCESSING_FAILURE
source: (Chip) Initiate Application Processing Failure
ru: (Карта) Ошибка инициализации приложения

# PNECardErrorType_SPIRE_CHIP_READ_APPLICATION_DATA_FAILURE
source: (Chip) Read Application Data Failure
ru: (Карта) Ошибка чтения данных приложения

# PNECardErrorType_SPIRE_CHIP_OFFLINE_DATA_AUTHENTICATION_FAILURE
source: (Chip) Offline Data Authentication Failure
ru: (Карта) Сбой проверки карты

# PNECardErrorType_SPIRE_CHIP_PROCESS_RESTRICTIONS_FAILURE
source: (Chip) Process Restrictions Failure
ru: (Катра) Ошибка проверки ограничений на карте

# PNECardErrorType_SPIRE_CHIP_TERMINAL_RISK_MANAGEMENT_FAILURE
source: (Chip) Terminal Risk Management Failure
ru: (Карта) Ошибка проверки ограничений на терминале

# PNECardErrorType_SPIRE_CHIP_CARDHOLDER_VERIFICATION_METHOD_FAILURE
source: (Chip) Cardholder Verification Method Failure
ru: (Карта) Ошибка проверки держателя карты

# PNECardErrorType_SPIRE_CHIP_TERMINAL_ACTION_ANALYSIS_FAILURE
source: (Chip) Terminal Action Analysis Failure
ru: (Карта) Ошибка проверки действий на терминале

# PNECardErrorType_SPIRE_CHIP_CARD_ACTION_ANALYSIS_FAILURE
source: (Chip) Card Action Analysis Failure
ru: (Карта) Ошибка при проверке допустимый действий

# PNECardErrorType_SPIRE_CHIP_COMPLETION_FAILURE
source: (Chip) Completion Failure
ru: (Карта) Неудачное завершение

# PNECardErrorType_SPIRE_EPOS_TRANSACTION_TERMINATED
source: (EPOS) Transaction Terminated
ru: (Терминал) Платеж отменен

# PNECardErrorType_SPIRE_CHIP_NO_ANSWER_TO_RESET
source: (Chip) No Answer to Reset
ru: (Карта) Нет ответа на сброс

# PNECardErrorType_SPIRE_SWIPE_READ_FAILURE
source: (Swipe) Read Failure
ru: (Карта) Ошибка чтения данных магнитной полосы

# PNECardErrorType_SPIRE_CHIP_CARD_REMOVED
source: (Chip) Card Removed
ru: (Карта) Карта извлечена во время платежа

# PNECardErrorType_SPIRE_MPOS_USER_CANCELLED
source: (mPOS) User Cancelled
ru: (Терминал) Отменено пользователем

# PNECardErrorType_SPIRE_CHIP_NO_SUPPORTED_APPLICATIONS
source: (Chip) No Supported Applications
ru: (Карта) Нет поддерживаемых приложений

# PNECardErrorType_SPIRE_CHIP_CARD_BLOCKED
source: (Chip) Card Blocked
ru: (Карта) Карта заблокирована

# PNECardErrorType_SPIRE_CHIP_READ_FAILURE
source: (Chip) Read Failure
ru: (Карта) Ошибка чтения

# PNECardErrorType_SPIRE_MPOS_USER_TIME_OUT
source: (mPOS) User Time Out
ru: (Терминал) Время ожидания превышено

# PNECardErrorType_SPIRE_MPOS_DUKPT_KEY_FAILURE
source: (mPOS) DUKPT Key Failure
ru: (Терминал) DUKPT Отказ ключа

# PNECardErrorType_SPIRE_MPOS_MK_SK_KEY_FAILURE
source: (mPOS) MK/SK Key Failure
ru: (Терминал) MK / SK Отказ ключа

# PNECardErrorType_SPIRE_CONTACTLESS_NOT_ALLOWED
source: (Contactless) Not Allowed
ru: (Карта) Не допускается

# PNECardErrorType_SPIRE_CONTACTLESS_ABORTED
source: (Contactless) Aborted
ru: (Карта) Прервано
